Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The Cassandra sink connector benefits from the WAL because it guards from nondeterministic keys and prevents inconsistent writes to Cassandra.
zh_cn: WAL对于Cassandra数据汇连接器的意义在于，它可以在键值不确定的情况下避免不一致的写入。

source: The Cassandra sink connector follows the same approach when the WAL is not enabled.
zh_cn: 在未启用WAL时，Cassandra数据汇连接器也会使用该方法。

source: The Cassandra sink connector with WAL is implemented based on Flink’s GenericWriteAheadSink operator.
zh_cn: 带有WAL的Cassandra数据汇连接器是基于Flink的GenericWriteAheadSink算子实现的。

source: The Cassandra sink connector with WAL-enabled implements this interface.
zh_cn: 启用WAL的Cassandra数据汇连接器就实现了该接口。

source: The CheckpointedFunction interface defines two methods, initializeState() and snapshotState(), which work similar to the methods of the ListCheckpointed interface for operator list state.
zh_cn: CheckpointedFunction接口定义了两个方法——initializeState()和snapshotState()，它们的工作模式和算子列表状态中ListCheckpointed接口的方法类似。

source: The CheckpointedFunction interface is the lowest-level interface to specify stateful functions.
zh_cn: CheckpointedFunction是用于指定状态化函数的最低级别接口。

source: The Checkpoints tab (Figure 10-3) displays statistics about previous and current checkpoints.
zh_cn: Checkpoints选项卡（图10-3）展示了有关以往和现在检查点的统计信息。

source: The CoProcessFunction
zh_cn: CoProcessFunction

source: The CoProcessFunction also provides an onTimer() callback method.
zh_cn: CoProcessFunction同样提供了onTimer()回调方法。

source: The ConnectedStreams object provides map() and flatMap() methods that expect a
zh_cn: ConnectedStreams对象提供了map()和flatMap()方法，

source: The Context object is what makes a process function special.
zh_cn: Context对象是让处理函数与众不同的精华所在。

source: The Context object of SinkFunction provides access to the current processing time, the current watermark (i.e., the current event time at the sink), and the timestamp of
zh_cn: 我们可以利用其中的Context对象访问当前处理时间，当前水位线（数据汇当前的事件时间）以及记录的时间戳。

source: The Context object of the ProcessWindowFunction gives access to the metadata of the window, the current pro‐
zh_cn: ProcessWindowFunction的Context对象可以用于访问窗口的元数据，

source: The DataSet API for Batch Processing
zh_cn: 用于批处理的DataSet API

source: The DataSet API provides operators to perform filtering, mapping, selection, joins, and groupings, as well as connectors to read and write datasets from and to external systems, such as filesystems and data‐ bases.
zh_cn: DataSet API提供了用于过滤、映射、选择、连接以及分组的算子，同时还有从外部系统（如文件系统和数据库）读写数据集的连接器。

source: The DataStream API (v1.7)
zh_cn: DataStream API （1.7版本）

source: The DataStream API (v1.7) | 79
zh_cn: DataStream API （1.7版本） | 79

source: The DataStream API (v1.7).
zh_cn: DataStream API （1.7版本）

source: The DataStream API exposes interfaces and methods to define custom window oper‐ ators by allowing you to implement your own assigners, triggers, and evictors.
zh_cn: DataStream API对外暴露了自定义窗口算子的接口和方法，你可以实现自己的分配器（assigner）、触发器（trigger）以及移除器（evictor）。

source: The DataStream API features the abstraction of a
zh_cn: 作为DataStream API中一类特殊的DataStream，KeyedStream抽象可以从逻辑上将事件按照键值分配到多条独立的子流中。

source: The DataStream API of Flink 1.7 features the WindowFunction interface.
zh_cn: Flink 1.7版本的DataStream API还提供了WindowFunction接口。

source: The DataStream API provides a family of low-level transformations, the process functions, which can also access record timestamps and watermarks and register timers that trigger at a specific time in the future.
zh_cn: DataStream API提供了一组相对底层的转换——处理函数。除了基本功能，它们还可以访问记录的时间戳和水位线，并支持注册在将来某个特定时间触发的计时器。

source: The DataStream API provides built-in methods for the most common window oper‐ ations as well as a very flexible windowing mechanism to define custom windowing logic.
zh_cn: DataStream API针对一些最常见窗口操作都提供了内置方法，还提供了一些非常灵活的窗口机制来自定义窗口逻辑。

source: The DataStream API provides different options for how to handle late events:
zh_cn: DataStream API提供了不同的选项来应对迟到事件：

source: The DataStream API provides event-time and processing-time assigners, as well as shortcut methods, and a time interval offset can be set as the third parameter to the window assigner:
zh_cn: DataStream API提供了针对事件时间和处理时间的分配器以及相关的简写方法。你可以将时间间隔偏移设为窗口分配器的第三个参数：

source: The DataStream API provides implementations for two common cases of timestamp assigners with periodic watermarks.
zh_cn: DataStream API内置了两个针对常见情况的周期性水位线时间戳分配器。

source: The DataStream API provides powerful yet easy-to-use tools to access and maintain operator state.
zh_cn: DataStream API提供了强大、易用的工具来访问和维护算子状态。

source: The DataStream API provides rich functions that expose more functionality than the regular functions discussed until now.
zh_cn: DataStream API提供了一类富函数，它和我们之前见到的普通函数相比可对外提供更多功能。

source: The DataStream API provides the TimestampAssigner interface to extract time‐ stamps from elements after they have been ingested into the streaming application.
zh_cn: DataStream API中提供了TimestampAssigner接口，用于从已读入流式应用的元素中提取时间戳。

source: The DataStream API provides the connect transformation to support such use cases.1 The DataStream.connect() method receives a DataStream and returns a Connected Streams object, which represents the two connected streams:
zh_cn: DataStream API提供的connect转换可以用来实现该用例。1 DataStream.connect()方法接收一个DataStream并返回一个ConnectedStream对象，该对象表示两个联结起来（connected）的流：

source: The DataStream API provides the following rolling aggregation methods:
zh_cn: DataStream API中提供了以下滚动聚合方法：

source: The DataStream API provides transformations for the most common data transfor‐ mation operations.
zh_cn: DataStream API为一些最常见的数据转换操作都提供了对应的转换抽象。

source: The DataStream API provides two interfaces to implement source connectors along with corresponding RichFunction abstract classes:
zh_cn: DataStream API提供了两个接口以及二者对应的RichFunction抽象类来实现数据源连接器：

source: The DataStream.split() method returns a SplitStream, which provides a select() method to select one or more streams from the SplitStream by specify‐ ing the output names.
zh_cn: DataStream.split()方法会返回一个SplitStream对象，它提供的select()方法可以让我们通过指定输出名称的方式从SplitStream中选择一条或多条流。

source: The DataStream.split() method receives an OutputSelector that defines how stream elements are assigned to named outputs.
zh_cn: DataStream.split()方法接收一个OutputSelector，它用来定义如何将数据流的元素分配到不同的命名输出（named output）中。

source: The DataStream.union() method merges two or more DataStreams of the same type and produces a new DataStream of the same type.
zh_cn: DataStream.union()方法可以合并两条或多条类型相同的DataStream，生成一个新的类型相同的DataStream。

source: The Datastream API provides two assigners—TumblingEventTimeWindows and Tum blingProcessingTimeWindows—for tumbling event-time and processing-time win‐ dows, respectively.
zh_cn: DataStream API针对事件时间和处理时间的滚动窗口分别提供了对应的分配器——TumblingEventTimeWindows和TumblingProcessingTimeWindows。

source: The Evictor interface
zh_cn: 移除器接口

source: The Evictor is an optional component in Flink’s windowing mechanism.
zh_cn: Evictor是Flink窗口机制中的一个可选组件。

source: The Evolution of Open Source Stream Processing
zh_cn: 开源流处理的演变

source: The Evolution of Open Source Stream Processing | 11
zh_cn: 开源流处理的演变 | 11

source: The FilterFunction interface is typed to the type of the input stream and defines the filter() method that is called with an input event and returns a boolean:
zh_cn: FilterFunction接口的类型为输入流的类型，它的filter()方法会接收一个输入事件，返回一个布尔值：

source: The Flink HA mode is configured in the ./conf/flink-conf.yaml file by setting the parameters as shown in Example 9-5.
zh_cn: 你可以像示例9-5那样在./conf/flink-conf.yaml文件中设置参数来配置Flink HA模式。

source: The Flink Kafka connector does not rely on Kafka’s own offset- tracking mechanism, which is based on so-called consumer groups.
zh_cn: Flink Kafka连接器并不依赖于Kafka自身基于消费者组（consumer group）的偏移追踪机制。

source: The Flink Kafka connector ingests event streams in parallel.
zh_cn: Flink Kafka连接器会以并行方式获取事件流。

source: The Flink Maven archetypes we introduced in “Bootstrap a Flink Maven Project” on page 76 generate Maven projects that are configured to produce application-fat JARs that include all required dependencies.
zh_cn: 我们在第76页"创建Flink Maven项目"中介绍了利用Flink Maven模板生成Maven项目，其中就加入了生成包含全部所需依赖的胖JAR的配置。

source: The Flink commu‐ nity is currently working on improving the support for state evolution.
zh_cn: Flink社区正在努力改善对状态变化的支持。

source: The Flink distribution folder must be located on all machines at the same path.
zh_cn: Flink发行版目录在所有机器上的路径必须一致。

source: The Flink docu‐ mentation provides more details on the configuration of S3 filesystems.
zh_cn: 你可以Flink文档中找到更多有关S3文件系统配置的详细信息。

source: The GenericWriteAheadSink template collects all outgoing records per check‐ point and stores them in the operator state of the sink task.
zh_cn: GenericWriteAheadSink模板会收集每个检查点周期内所有需要写出的记录，并将它们存储到数据汇任务的算子状态中。

source: The GlobalWindows Assigner
zh_cn: GlobalWindows分配器

source: The GlobalWindows assigner maps all elements to the same global window.
zh_cn: GlobalWindows分配器会将所有元素映射到一个全局窗口中。

source: The ID of a job can be obtained from the Web UI, the REST API, or using the command-line client.
zh_cn: 该作业ID可以通过Web UI、REST API或命令行客户端获取。

source: The Iterable parameter of the ProcessWindowFunc tion.process() method will only provide a single value, the incrementally aggrega‐
zh_cn: 这样传递给ProcessWindowFunction.process()方法的Iterable参数内将只有一个值，即增量聚合的结果。

source: The JAR file of a dependency can be added to the ./lib folder of a Flink setup.
zh_cn: 可以将依赖的JAR包放到设置Flink的./lib目录中。

source: The Java API provides an AsyncDataStream class with the respective static methods.
zh_cn: Java API中提供了包含这些静态方法的AsyncDataStream类。

source: The JobID can be obtained via the REST API, the Web UI, or the log files.
zh_cn: 其中的JobID可以通过REST API、Web UI或者日志文件得到。

source: The JobID is used to specify the job when taking a save‐ point, canceling, or rescaling an application.
zh_cn: 该JobID可以在生成保存点、取消应用或对应用进行扩缩容时用来指定作业。

source: The JobManager can then assign tasks to the slots to execute them.
zh_cn: 之后，JobManager就可以向处理槽中分配任务来执行。

source: The JobManager can then assigns tasks to the slots to execute them.
zh_cn: 随后，JobManager就可以向处理槽中分配任务来执行。

source: The JobManager con‐ verts the JobGraph into a physical dataflow graph called the ExecutionGraph, which consists of tasks that can be executed in parallel.
zh_cn: JobManager将JobGraph转化成名为ExecutionGraph的物理dataflow图，该图包含了那些可以并行执行的任务。

source: The JobManager controls the execution of a streaming application and keeps metadata about its execution, such as pointers to completed checkpoints.
zh_cn: 它用于控制流式应用执行以及保存该过程中的元数据（如已完成检查点的存储路径）。

source: The JobManager converts the JobGraph into a physical dataflow graph called the ExecutionGraph, which consists of tasks that can be executed in parallel.
zh_cn: JobManager将JobGraph转化成名为ExecutionGraph的物理Dataflow图，该图包含了那些可以并行执行的任务。

source: The JobManager is the master process that controls the execution of a single application—each application is controlled by a different JobManager.
zh_cn: 作为主进程（master process），JobManager控制着单个应用的执行。换句话说，每个应用都由一个不同的JobManager掌控。

source: The JobManager receives an application for execution.
zh_cn: JobManager可以接收用于执行的应用，

source: The JobManager records the check‐ point of an application as completed once it has received a checkpoint acknowledge‐ ment from all tasks of the application.
zh_cn: JobManager在接收到所有应用任务返回的检查点确认消息后，就会将此次检查点标记为完成。

source: The JobManager requests the necessary processing slots from the ResourceManager and deploys the job for execution once the requested slots have been received.
zh_cn: JobManager向ResourceManager申请必要数量的处理槽，并在处理槽准备完毕后将作业部署执行。

source: The JobManager requests the necessary resources (TaskManager slots) to execute the tasks from the ResourceManager.
zh_cn: JobManager从ResourceManager申请执行任务的必要资源（TaskManager处理槽）。

source: The JobManager requests the required slots from the ResourceManager to run the Flink job.
zh_cn: JobManager会向ResourceManager申请运行Flink作业所需的处理槽。

source: The JobManager spans the JobGraph into an ExecutionGraph and assigns the tasks to the four avail‐ able slots.
zh_cn: JobManager将JobGraph转成ExecutionGraph并将任务分配到4个空闲槽。

source: The Job‐ Manager receives an application for execution.
zh_cn: JobManager可以接收要执行的应用，

source: The Job‐ Manager spans the JobGraph into an ExecutionGraph and assigns the tasks to the four available slots.
zh_cn: JobManager将JobGraph"展开成"ExecutionGraph并把任务分配到4个空闲处理槽。

source: The Kafka sink provides at-least-once guarantees under the following condi‐ tions:
zh_cn: 在满足以下条件时，它才可以提供精确一次保障：

source: The KeyedProcessFunction is a very versatile function and can be applied to a Keyed Stream.
zh_cn: KeyedProcessFunction作用于KeyedStream之上，它的用法非常灵活。

source: The Lambda architecture aimed to improve the high result latency of the original batch analytics architecture.
zh_cn: Lambda架构旨在改善原始批量分析架构中结果的高延迟问题，

source: The Lambda architecture augments the traditional periodic batch processing archi‐ tecture with a Speed Layer that is powered by a low-latency stream processor.
zh_cn: Lambda架构在传统周期性批处理架构的基础上添加了一个由低延迟流处理引擎所驱动的"提速层"。

source: The Lambda architecture.
zh_cn: Lambda架构

source: The ListCheckpointed interface does not work with state handles like Val ueState or ListState, which are registered at the state backend.
zh_cn: 该接口不像ValueState或ListState状态句柄那样直接在状态后端注册，

source: The ListCheckpointed interface uses Java serialization to serialize and deserialize the list of state objects.
zh_cn: ListCheckpointed接口使用Java序列化机制来对状态对象进行序列化和反序列化。

source: The ListState implementation of RocksDBStateBackend deseri‐ alizes all list entries before constructing Iterable to read the values.
zh_cn: 在构造用于数据访问的Iterable对象之前，RocksDBStateBackend的ListState需要将它所有的列表条目反序列化。

source: The MapFunction is typed to the types of the input and output events and can be specified using the MapFunction interface.
zh_cn: MapFunction的两个类型参数分别是输入事件和输出事件的类型，它们可以通过MapFunction接口来指定。

source: The MergingWindowAssigner is used for win‐ dow operators that need to merge existing windows.
zh_cn: MergingWindowAssigner可用于需要对已有窗口进行合并的窗口算子。

source: The Met ricGroup provides ways to create nested, named metrics hierarchies and provides methods to register the following metric types:
zh_cn: MetricGroup提供了各种创建嵌套、命名指标层次（metrics hierarchy）的方法，并提供了注册以下指标类型的方法：

source: The OnTimerContext provides the same serv‐
zh_cn: OnTimerContext能够提供和processElement()方法中的Context对象相同的服务，

source: The OutputSelector defines the select() method that is called for each input event and returns a java.lang.Itera ble[String].
zh_cn: OutputSelector中定义的select()方法会在每个输入事件到来时被调用，并随即返回一个java.lang.Iterable[String]对象。

source: The ProcessWindowFunction is a full window function.
zh_cn: ProcessWindowFunction就是一个全量窗口函数。

source: The QueryableStateClient is initialized with the hostname of any TaskManager and the port on which the queryable state client proxy is listening.
zh_cn: 为了初始化QueryableStateClient，你需要提供任意一个TaskManager的主机名以及其上可查询式状态客户端代理的监听端口。

source: The QueryableStateClient is used by an external application to submit queries and retrieve results.
zh_cn: QueryableStateClient用于外部系统提交查询及获取结果。

source: The QueryableStateClientProxy accepts and serves client requests.
zh_cn: QueryableStateClientProxy用于接收并响应客户端请求。

source: The QueryableStateServer serves the requests of a client proxy.
zh_cn: QueryableStateServer用于处理客户端代理的请求。

source: The REST API also provides more detailed information about the following aspects of an application:
zh_cn: REST API还提供了和应用以下方面相关的更多详细信息：

source: The REST API can also be used to manage and monitor Flink applications.
zh_cn: REST API还可用于管理和监控Flink应用。

source: The REST API can be directly accessed by users or scripts and exposes information about the Flink cluster and its applications, including metrics as well as endpoints to submit and control applications.
zh_cn: REST API可供用户或脚本直接访问，它可以对外公开有关Flink集群和应用的信息，包括指标数据及用于提交和控制应用程序的端点。

source: The REST API exposes endpoints to query information about a running cluster and to shut it down.
zh_cn: REST API公开的一些端点可用来查询有关正在运行集群的信息或将其关闭。

source: The REST API is the underlying interface that is used by the command-line cli‐ ent and Web UI.
zh_cn: 一套用于命令行客户端和Web UI的底层REST API。

source: The REST interface enables the dispatcher to serve as an HTTP entry point to clusters that are behind a firewall.
zh_cn: REST接口允许Dispatcher作为防火墙后集群的一个HTTP入口点。

source: The REST interface enables the dispatcher to serve as an HTTP entry point to clusters that are behind a fire‐ wall.
zh_cn: REST接口使得Dispatcher可以作为防火墙后集群的一个HTTP入口点。

source: The ReduceFunction was introduced in “KeyedStream Transformations” on page 87 when discussing running aggregations on keyed streams.
zh_cn: 我们已经在第87页"基于KeyedStream的转换"一节讨论在键值分区流上运行聚合时介绍过ReduceFunction。

source: The Resour‐ ceManager also takes care of terminating idle TaskManagers to free compute resources.
zh_cn: 同时，ResourceManager还负责终止空闲的TaskManager以释放计算资源。

source: The ResourceManager also takes care of terminating idle TaskManagers to free com‐ pute resources.
zh_cn: 同时，ResourceManager还负责终止空闲的TaskManager以释放计算资源。

source: The ResourceManager assigns TaskManagers to the JobManager, which deploys the job once all required resources are available.
zh_cn: ResourceManager负责将TaskManager分配给JobManager，而JobManager在所有资源备齐后会对作业进行部署。

source: The ResourceManager hands out the previously idling processing slots and the application restarts.
zh_cn: ResourceManager将之前空闲的处理槽分发出去，应用就会重新启动。

source: The ResourceManager is responsible for managing TaskManager slots, Flink’s unit of processing resources.
zh_cn: ResourceManager负责管理Flink的处理资源单元——TaskManager处理槽。

source: The Rest of the Flink Ecosystem
zh_cn: Flink生态的其他组成部分

source: The RocksDBStateBackend also checkpoints the state to a remote and persistent file system.
zh_cn: RocksDBStateBackend同样会将状态以检查点形式写入远程持久化文件系统。

source: The RuntimeContext can be used to retrieve information such as the function’s parallelism, its subtask index, and the name of the task that executes the
zh_cn: 从RuntimeContext中能够获取到一些信息，例如函数的并行度，它所在子任务的索引号以及执行函数的任务名称。

source: The Scala DataStream API also has built-in support for lambda functions.
zh_cn: Scala DataStream API同样内置了对Lambda函数的支持。

source: The Scala DataStream API offers syntactic shortcuts to define map and flatMap func‐ tions with a single ValueState.
zh_cn: Scala DataStream API为只有单个ValueState的map和flatMap函数提供了简便写法。

source: The Scala DataStream API uses regular Scala tuples.
zh_cn: Scala DataStream API使用常规Scala元组。

source: The SimpleStringSchema, which is used in Example 8-1, is a built-in DeserializationSchema that simply deserializes a byte array into a String.
zh_cn: 示例8-1中用到的SimpleStringSchema是一个内置的DeserializationSchema，它会简单地将字节数组反序列化成String。

source: The StateDe scriptor is specific to the state primitive and includes the name of the state and the data types of the state.
zh_cn: 每个状态原语都有自己特定的StateDescriptor，它其中包含了状态名称和类型。

source: The Stream ingFileSink ensures this does not result in data loss.
zh_cn: 虽然StreamingFileSink保证不会因此导致数据丢失。

source: The StreamExecutionEnvironment provides methods to create stream sources that ingest data streams into the application.
zh_cn: StreamExecutionEnvironment为我们提供了一系列创建流式数据源的方法，用以将数据流读取到应用中。

source: The String values that are returned for a record specify the output
zh_cn: 针对某记录所返回的一系列String值指定了该记录需要被发往哪些输出流。

source: The Summary view aggregates checkpoint statistics and provides minimum, maximum, and average values over all completed checkpoints.
zh_cn: Summary页面会对检查点的统计信息进行聚合，提供所有已完成检查点的最小、最大和平均值。

source: The Table API is a language-integrated query (LINQ) API for Scala and Java.
zh_cn: Table API是一个在Scala和Java之上的LINQ（language-integrated query语言集成查询） API。

source: The TaskMan‐ agers take care of shipping data from sending tasks to receiving tasks.
zh_cn: TaskManager负载将数据从发送任务传输至接收任务。

source: The TimerService and Timers
zh_cn: TimerService和定时器

source: The TimerService of the Context and OnTimerContext objects offers the following methods:
zh_cn: Context和OnTimerContext对象中的TimerService提供了以下方法：

source: The Trigger interface features a call‐ back method that is invoked when windows are merged to merge state that is associ‐
zh_cn: Trigger接口有一个回调方法，会在对目标窗口的相关状态进行合并时被调用。

source: The TwoPhase CommitSinkFunction works quite similar to the WAL sink, but it does not collect records in Flink’s application state; rather, it writes them in an open transaction to an
zh_cn: TwoPhaseCommitSinkFunction的工作原理和基于WAL的数据汇类似，但它不会在Flink的应用状态中收集记录，而是会把它们写入外部数据汇系统某个开启的事务中。

source: The TwoPhaseCommitSinkFunction implements the following protocol.
zh_cn: TwoPhaseCommitSinkFunction实现的协议如下。

source: The TwoPhaseCommitSinkFunction template leverages transactional features of the external sink system.
zh_cn: TwoPhaseCommitSinkFunction模板充分利用了外部数据汇系统的事务功能。

source: The WAL is stored and checkpointed as operator state.
zh_cn: WAL会以算子状态的形式存储和写入检查点。

source: The WAL sink writes all result records into application state and emits them to the sink system once it receives the notification that a checkpoint was completed.
zh_cn: WAL数据汇会将所有结果记录写入应用状态中，并在收到检查点完成通知后将它们发送到数据汇系统。

source: The Web UI can be used to upload application JAR files and run the application.
zh_cn: Web UI可用来上传应用JAR包并运行应用。

source: The Web UI is a web interface that provides details and metrics about a Flink cluster and running applications.
zh_cn: 一个用于提供有关Flink集群和当前运行应用详细信息及指标的Web UI。

source: The Web UI is described in “Flink Web UI”.
zh_cn: 有关Web UI的信息请参照"Flink Web UI"一节。

source: The Web UI of the started Flink cluster is served by the master process running on some node in the YARN cluster.
zh_cn: Flink集群的Web UI由YARN集群某个节点上的主进程负责提供。

source: The WindowAssigner determines for each arriving element to which windows it is assigned.
zh_cn: WindowAssigner用于决定将到来的元素分配给哪些窗口。

source: The WindowAssigner returns zero, one, or multiple window objects.
zh_cn: WindowAssigner会返回零个、一个或多个窗口对象。

source: The above command sets the default parallelism of the execution environment to 16.
zh_cn: 上述命令会把执行环境的默认并行度设置为16。

source: The above command starts the application from the main() method of the class that is referenced in the program-class property of the JAR file’s META-INF/MANI‐ FEST.MF file without passing any arguments to the application.
zh_cn: 上述命令会从JAR包中META-INF/MANIFEST.MF文件内program-class属性所引用的main()方法启动应用，且不会向其传递任何参数。

source: The accumulator maintains a running sum and count and the getResult() method computes the average value.
zh_cn: 其累加器负责维护不断变化的温度总和及数量，getResult()方法用来计算平均值。

source: The acknowledgment messages to the JobManager are analogous to the commit vote of the textbook 2PC protocol.
zh_cn: 该确认消息对于JobManager而言相当于2PC协议中的提交投票。

source: The advantages of applying ReduceFunction on a window are the constant and small state size per window and the simple function interface.
zh_cn: 在窗口上应用ReduceFunction的优点是只须为每个窗口维护一个常数级别的小状态，此外函数的接口也很简单。

source: The algorithm does not pause the complete application but decouples checkpointing from processing, so that some tasks continue processing while others persist their state.
zh_cn: 该算法不会暂停整个应用，而是会把生成检查点的过程和处理过程分离，这样在部分任务持久化状态的过程中，其他任务还可以继续执行。

source: The amount of memory assigned for network buffers is configured with the taskman ager.network.memory.fraction key, which determines the fraction of the JVM size allocated for network buffers.
zh_cn: 设置内存分配量的配置项是taskmanager.network.memory.fraction，它的值决定了JVM为网络缓冲区分配的内存比例，

source: The animal on the cover of Stream Processing with Apache Flink is a Eurasian red squirrel (Sciurus vulgaris).
zh_cn: 本书封面上的动物是欧亚红松鼠（Sciurus vulgaris）。

source: The appli‐ cation we are going to run converts and aggregates randomly generated temperature sensor readings by time.
zh_cn: 该应用会读取随机生成的温度传感器数值，并按时间对它们执行转换和聚合操作。

source: The application consists of a so- called JobGraph, a logical dataflow graph (see “Introduction to Dataflow Programming”), and a JAR file that bundles all the required classes, libraries, and other resources.
zh_cn: 该应用会包含一个所谓的JobGraph，一个逻辑Dataflow图（见"Dataflow编程介绍"），以及一个打包了全部所需类、库以及其他资源的JAR文件。
